gab-nix/reticulum-native/firmware/heltec_wifi_lora_32_v3_1/sdkconfig.defaults
# Heltec WiFi LoRa 32 V3.1: ESP32-S3FN8, 8 MiB flash, no PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# CP2102 console on UART0, GPIO43/GPIO44.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y

# Reticulum crypto primitives. ESP-IDF selects ESP32-S3 accelerated AES and
# SHA implementations where the configured operation supports them.
CONFIG_MBEDTLS_AES_C=y
CONFIG_MBEDTLS_SHA256_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y

# libsodium 1.0.22 must use its own SHA state implementation on ESP32-S3.
# Its mbedTLS compatibility wrapper is unsafe with ESP-IDF hardware SHA state,
# while Reticulum's direct one-shot mbedTLS provider can retain acceleration.
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=n

# Never enable flash encryption or eFuse operations from development defaults.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
